Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.NoSpacesWarn Property
 Revit was unable to identify any spaces. If you are sure that spaces have been created in the project, please check the Project Phase setting to verify that the Project Phase matches the phase in which spaces have been defined in your project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoSpacesWarn { get; }
Public Shared ReadOnly Property NoSpacesWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoSpacesWarn {
	FailureDefinitionId^ get ();
}
static member NoSpacesWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace